<table style="margin: 0px auto;background-color:rgba(0, 0, 0, 0);">
    <tr>
        <td><img src="https://upload.wikimedia.org/wikipedia/commons/3/3b/Udacity_logo.png" width=150 height=150 style="float;"></td>
        <td><p style="text-align:center;color:#5EA1DD;font-size:175%">Udacity Data Science Nanodegree - Student Notes &nbsp;&nbsp;<p></td>
    </tr>
</table>

<p style="text-align:center;color:#445089">Navneet Kumar ||
<a href="https://github.com/Navneetkr870">https://github.com/Navneetkr870</a> || <a href="https://www.linkedin.com/in/navneetkr870/">https://www.linkedin.com/in/navneetkr870/</a></p>

____________________________________________________________________________________________

<p style="text-align:left;">
    <a href=" "> Previous Page </a>
    <span style="float:right;">
        <a href=" "> Next Page </a>
    </span>
</p>

<p style="text-align:center;color:#2CB23C;font-size:200%;"> 
    -- 1.5 Python Basics - Pandas -- 
</p>

____________________________________________________________________________________________

In this section we would look into the Pandas basics

---

## 1. Pandas Intro

A Pandas series is a one-dimensional array-like object that can hold many data types, such as numbers or strings. The name Pandas is derived from the econometrics term Panel Data.<br><br>
One of the main differences between Pandas Series and NumPy ndarrays is that you can **assign an index label** to each element in the Pandas Series. In other words, you can name the indices of your Pandas Series anything you want. Another big difference between Pandas Series and NumPy ndarrays is that Pandas Series can **hold data of different data types.**

In [2]:
import pandas as pd

In [5]:
groceries=pd.Series(data=[30,6,'Yes','No'], index=['eggs','milk','bread','cereal'])
groceries

eggs       30
milk        6
bread     Yes
cereal     No
dtype: object

In [9]:
# We print some information about Groceries
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

## 2. Printing Value or Indexes

In [8]:
# We print the index and data of Groceries
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'milk', 'bread', 'cereal'], dtype='object')

In [11]:
# We check whether bananas is a food item (an index) in Groceries
x = 'bananas' in groceries

# We check whether bread is a food item (an index) in Groceries
y = 'bread' in groceries

# We print the results
print('Is bananas an index label in Groceries:', x)
print('Is bread an index label in Groceries:', y)

Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

## 3. Accessing Items

You can access a data item  in many ways like we did with Numpy and basic arrays. But as we can assign both indexes and locations, one can follow both to access a particular elements

In [17]:
groceries[:2]

eggs    30
milk     6
dtype: object

### a. loc - For explicit index values

In [13]:
groceries.loc[['eggs','bread']]

eggs      30
bread    Yes
dtype: object

### b. iloc - For explicit integer values

In [15]:
groceries.iloc[[2,3]]

bread     Yes
cereal     No
dtype: object

## 4. Deleting items

In [19]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

# We remove apples from our grocery list. The drop function removes elements out of place
print()
print('We remove apples (out of place):\n', groceries.drop('bread'))

# When we remove elements out of place the original Series remains intact. To see this
# we display our grocery list again
print()
print('Grocery List after removing apples out of place:\n', groceries)

Original Grocery List:
 eggs       30
milk        6
bread     Yes
cereal     No
dtype: object

We remove apples (out of place):
 eggs      30
milk       6
cereal    No
dtype: object

Grocery List after removing apples out of place:
 eggs       30
milk        6
bread     Yes
cereal     No
dtype: object

Notice that this only drops the bread for the print statement. If you want to change the Series, you would have to use inplace

In [20]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

# We remove apples from our grocery list in place by setting the inplace keyword to True
groceries.drop('bread', inplace = True)

# When we remove elements in place the original Series its modified. To see this
# we display our grocery list again
print()
print('Grocery List after removing apples in place:\n', groceries)

Original Grocery List:
 eggs       30
milk        6
bread     Yes
cereal     No
dtype: object

Grocery List after removing apples in place:
 eggs      30
milk       6
cereal    No
dtype: object

## 5. Pandas Data Frames

In [1]:
# Import Pandas
import pandas as pd

In [2]:
# Create a dictionary
items = {'Bob' : pd.Series(data=[1,2,3], index=['apple','boy','cat']),
         'Alice' : pd.Series(data=[11,22,33,44], index=['apple','boy','dog','cat'])
        }
print (items)

{'Bob': apple    1
boy      2
cat      3
dtype: int64, 'Alice': apple    11
boy      22
dog      33
cat      44
dtype: int64}

In [3]:
print(type(items))

<class 'dict'>

In [8]:
shopping_carts=pd.DataFrame(items)
shopping_carts

       Bob  Alice
apple  1.0     11
boy    2.0     22
cat    3.0     44
dog    NaN     33

In [6]:
# We print some information about shopping_carts
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (4, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 8 elements

The data in shopping_carts is:
 [[ 1. 11.]
 [ 2. 22.]
 [ 3. 44.]
 [nan 33.]]

The row index in shopping_carts is: Index(['apple', 'boy', 'cat', 'dog'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

## 6. Customised Pandas data frames from dictionary

In [9]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
apple    1
boy      2
cat      3

## 7. Dealing with NaN values

In [44]:
# Create a dataframe

items = [{'bike':20,'car':10,'scooter':100,'truck':10},
         {'truck':100,'bike':100},
         {'car':100,'bike':20}
        ]

store_items = pd.DataFrame(items, index={'user1','user2','user3'})
store_items_copy=store_items
store_items

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100    NaN      NaN  100.0
user3    20  100.0      NaN    NaN

In [25]:
x=store_items.isnull()
print(x)

        bike    car  scooter  truck
user2  False  False    False  False
user1  False   True     True  False
user3  False  False     True   True

In [26]:
y=x.sum()
print(y)

bike       0
car        1
scooter    2
truck      1
dtype: int64

In [27]:
z=x.sum().sum()
print(z)

4

In [29]:
store_items.dropna(axis=0)

       bike   car  scooter  truck
user2    20  10.0    100.0   10.0

In [31]:
store_items.dropna(axis=1)

       bike
user2    20
user1   100
user3    20

In [33]:
store_items

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100    NaN      NaN  100.0
user3    20  100.0      NaN    NaN

## 7b. How can we drop in the original dataframe

In [34]:
store_items.dropna(axis=1, inplace = True)

In [35]:
store_items

       bike
user2    20
user1   100
user3    20

## 7c. Filling in NaN values with default

In [39]:
store_items.fillna(99)

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100   99.0     99.0  100.0
user3    20  100.0     99.0   99.0

In [41]:
store_items

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100    NaN      NaN  100.0
user3    20  100.0      NaN    NaN

In [42]:
store_items.fillna(99, inplace=True)

In [46]:
store_items_copy

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100    NaN      NaN  100.0
user3    20  100.0      NaN    NaN

## 7d. Filling in NaN values with values within Dataframe

In [48]:
store_items_copy.fillna(method='ffill',axis=0)

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100   10.0    100.0  100.0
user3    20  100.0    100.0  100.0

In [49]:
store_items_copy.fillna(method='backfill',axis=0)

       bike    car  scooter  truck
user2    20   10.0    100.0   10.0
user1   100  100.0      NaN  100.0
user3    20  100.0      NaN    NaN

You would notice that these values are been filled up by the values either coming before them or after them. Think about SAS equivalent of LEAD or LAG functions

## 8. Manipulation of data using Pandas - Quiz

In [1]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

dat

{'Book Title': 0     Great Expectations
 1        Of Mice and Men
 2       Romeo and Juliet
 3       The Time Machine
 4    Alice in Wonderland
 dtype: object, 'Author': 0        Charles Dickens
 1         John Steinbeck
 2    William Shakespeare
 3            H. G. Wells
 4          Lewis Carroll
 dtype: object, 'User 1': 0    3.2
 1    NaN
 2    2.5
 dtype: float64, 'User 2': 0    5.0
 1    1.3
 2    4.0
 3    3.8
 dtype: float64, 'User 3': 0    2.0
 1    2.3
 2    NaN
 3    4.0
 dtype: float64, 'User 4': 0    4.0
 1    3.5
 2    4.0
 3    5.0
 4    4.2
 dtype: float64}

In [75]:
book_ratings = pd.DataFrame(dat)
book_ratings_copy=book_ratings.copy()
book_ratings.fillna(book_ratings.mean(), axis=0, inplace = True)
book_ratings_copy

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [71]:
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [78]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)

## 9. Loading CSV

In [95]:
Google_stock = pd.read_csv('./Data/goog.csv')

### Checking Shape

In [97]:
Google_stock.shape

(3313, 7)

### Top 10 Rows

In [93]:
Google_stock.head(10)

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400
5  2004-08-26  52.1  53.6  52.0   53.6       53.6   7148200
6  2004-08-27  53.7  54.0  52.5   52.7       52.7   6258300
7  2004-08-30  52.3  52.4  50.7   50.7       50.7   5235700
8  2004-08-31  50.8  51.5  50.7   50.9       50.9   4954800
9  2004-09-01  51.0  51.2  49.5   49.8       49.8   9206800

### Checking Nulls

In [100]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

### Proc Mean Statistics

In [101]:
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [103]:
Google_stock['Open'].describe()

count    3313.0
mean      380.2
std       223.8
min        49.3
25%       226.6
50%       293.3
75%       536.7
max       992.0
Name: Open, dtype: float64

In [107]:
Google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0

In [109]:
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

### Using Group by Function

As this data doesn't have any aggregate level variables - Let's create Year and Month

In [128]:
Google_stock['year']=pd.DatetimeIndex(Google_stock['Date']).year 
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume  year
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500  2004
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800  2004
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200  2004
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800  2004
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400  2004

In [130]:
Google_stock['month']=pd.DatetimeIndex(Google_stock['Date']).month
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume  year  month
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500  2004      8
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800  2004      8
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200  2004      8
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800  2004      8
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400  2004      8

In [131]:
Google_stock.groupby(['year'])['High'].max()

year
2004    100.1
2005    221.7
2006    254.8
2007    371.2
2008    346.4
2009    311.0
2010    313.4
2011    321.3
2012    384.7
2013    556.9
2014    610.5
2015    780.0
2016    816.7
2017    997.2
Name: High, dtype: float64

In [132]:
Google_stock.groupby(['year','month'])['High'].max()

year  month
2004  8         56.4
      9         67.1
      10        99.3
      11       100.1
      12        99.3
2005  1        102.0
      2        107.7
      3         94.3
      4        111.6
      5        138.3
      6        153.6
      7        157.9
      8        148.9
      9        159.4
      10       186.2
      11       214.2
      12       221.7
2006  1        236.0
      2        201.9
      3        198.2
      4        223.9
      5        208.4
      6        208.3
      7        212.6
      8        193.7
      9        208.0
      10       244.4
      11       254.8
      12       244.6
2007  1        254.8
               ...
2015  5        544.2
      6        543.7
      7        678.6
      8        674.9
      9        650.9
      10       730.0
      11       762.7
      12       780.0
2016  1        752.0
      2        789.9
      3        757.9
      4        769.9
      5        739.7
      6        737.2
      7        778.5
      8        789.8
      9        789.8
      10       816.7
      11       795.6
      12       804.4
2017  1        842.0
      2        833.5
      3        853.5
      4        916.8
      5        979.3
      6        988.2
      7        986.2
      8        942.0
      9        959.8
      10       997.2
Name: High, Length: 159, dtype: float64

---

In the next section, we will look into Pandas project work